
;----------------------------------------------------------------------
;			includes cc65
;----------------------------------------------------------------------
.feature string_escapes

.include "telestrat.inc"
.include "errno.inc"

;----------------------------------------------------------------------
;			includes SDK
;----------------------------------------------------------------------
.include "SDK.mac"
.include "types.mac"

;----------------------------------------------------------------------
;			include application
;----------------------------------------------------------------------
.include "include/dbase.inc"
.include "macros/readline.mac"

;----------------------------------------------------------------------
;				imports
;----------------------------------------------------------------------
.ifdef SUBMIT
	.importzp pfac
	.import param_type
	.import error_code
.endif

;----------------------------------------------------------------------
;				exports
;----------------------------------------------------------------------
.export cmnd_quit

;----------------------------------------------------------------------
;                       Segments vides
;----------------------------------------------------------------------
.segment "STARTUP"
.segment "INIT"
.segment "ONCE"

;----------------------------------------------------------------------
;			Defines / Constantes
;----------------------------------------------------------------------

;----------------------------------------------------------------------
;				Variables
;----------------------------------------------------------------------
.pushseg
	.segment "ZEROPAGE"

	.segment "DATA"
.popseg

;----------------------------------------------------------------------
;			Chaines statiques
;----------------------------------------------------------------------
.pushseg
	.segment "RODATA"

.popseg

;----------------------------------------------------------------------
;			Programme principal
;----------------------------------------------------------------------
.segment "CODE"

;----------------------------------------------------------------------
;
; Entrée:
;
; Sortie:
;	A: $ff
;	X: inchangé
;	Y: inchangé
;	C: 1
;
; Variables:
;	Modifiées:
;		-
;	Utilisées:
;		-
; Sous-routines:
;	-
;----------------------------------------------------------------------
.ifndef SUBMIT
	.proc cmnd_quit
			lda	#$ff
			sec
			rts
	.endproc
.endif

;----------------------------------------------------------------------
;
; Entrée:
;
; Sortie:
;	A: $ff
;	X: code erreur
;	Y: inchangé
;	C: 1
;
; Variables:
;	Modifiées:
;		error_code
;
;	Utilisées:
;		param_type
;		pfac
;
; Sous-routines:
;	-
;----------------------------------------------------------------------
.ifdef SUBMIT
	.proc cmnd_quit
			; Valeur par défaut du paramètre: dernier code erreur
			ldx	error_code

			; Paramètre présent?
			lda	param_type
			beq	end

			ldx	pfac

		end:
			stx	error_code

			lda	#$ff
			sec
			rts
	.endproc
.endif
